grevaillot/svd_tools/headers/STM32F091x/can.h
/** @defgroup can_can_ti0r CANTI0R CAN_TI0R
@{*/


#define CAN_CAN_TI0R_STID_SHIFT		21
#define CAN_CAN_TI0R_STID_MASK		0x7ff
/** @defgroup can_can_ti0r_stid STID STID
@{*/
/**@}*/


#define CAN_CAN_TI0R_EXID_SHIFT		3
#define CAN_CAN_TI0R_EXID_MASK		0x3ffff
/** @defgroup can_can_ti0r_exid EXID EXID
@{*/
/**@}*/

/** CAN_CAN_TI0R_IDE IDE **/
#define CAN_CAN_TI0R_IDE		(1 << 2)
/** CAN_CAN_TI0R_RTR RTR **/
#define CAN_CAN_TI0R_RTR		(1 << 1)
/** CAN_CAN_TI0R_TXRQ TXRQ **/
#define CAN_CAN_TI0R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can_can_tdt0r CANTDT0R CAN_TDT0R
@{*/


#define CAN_CAN_TDT0R_TIME_SHIFT		16
#define CAN_CAN_TDT0R_TIME_MASK		0xffff
/** @defgroup can_can_tdt0r_time TIME TIME
@{*/
/**@}*/

/** CAN_CAN_TDT0R_TGT TGT **/
#define CAN_CAN_TDT0R_TGT		(1 << 8)

#define CAN_CAN_TDT0R_DLC_SHIFT		0
#define CAN_CAN_TDT0R_DLC_MASK		0x0f
/** @defgroup can_can_tdt0r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_tdl0r CANTDL0R CAN_TDL0R
@{*/


#define CAN_CAN_TDL0R_DATA3_SHIFT		24
#define CAN_CAN_TDL0R_DATA3_MASK		0xff
/** @defgroup can_can_tdl0r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN_CAN_TDL0R_DATA2_SHIFT		16
#define CAN_CAN_TDL0R_DATA2_MASK		0xff
/** @defgroup can_can_tdl0r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN_CAN_TDL0R_DATA1_SHIFT		8
#define CAN_CAN_TDL0R_DATA1_MASK		0xff
/** @defgroup can_can_tdl0r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN_CAN_TDL0R_DATA0_SHIFT		0
#define CAN_CAN_TDL0R_DATA0_MASK		0xff
/** @defgroup can_can_tdl0r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_tdh0r CANTDH0R CAN_TDH0R
@{*/


#define CAN_CAN_TDH0R_DATA7_SHIFT		24
#define CAN_CAN_TDH0R_DATA7_MASK		0xff
/** @defgroup can_can_tdh0r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN_CAN_TDH0R_DATA6_SHIFT		16
#define CAN_CAN_TDH0R_DATA6_MASK		0xff
/** @defgroup can_can_tdh0r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN_CAN_TDH0R_DATA5_SHIFT		8
#define CAN_CAN_TDH0R_DATA5_MASK		0xff
/** @defgroup can_can_tdh0r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN_CAN_TDH0R_DATA4_SHIFT		0
#define CAN_CAN_TDH0R_DATA4_MASK		0xff
/** @defgroup can_can_tdh0r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_ti1r CANTI1R CAN_TI1R
@{*/


#define CAN_CAN_TI1R_STID_SHIFT		21
#define CAN_CAN_TI1R_STID_MASK		0x7ff
/** @defgroup can_can_ti1r_stid STID STID
@{*/
/**@}*/


#define CAN_CAN_TI1R_EXID_SHIFT		3
#define CAN_CAN_TI1R_EXID_MASK		0x3ffff
/** @defgroup can_can_ti1r_exid EXID EXID
@{*/
/**@}*/

/** CAN_CAN_TI1R_IDE IDE **/
#define CAN_CAN_TI1R_IDE		(1 << 2)
/** CAN_CAN_TI1R_RTR RTR **/
#define CAN_CAN_TI1R_RTR		(1 << 1)
/** CAN_CAN_TI1R_TXRQ TXRQ **/
#define CAN_CAN_TI1R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can_can_tdt1r CANTDT1R CAN_TDT1R
@{*/


#define CAN_CAN_TDT1R_TIME_SHIFT		16
#define CAN_CAN_TDT1R_TIME_MASK		0xffff
/** @defgroup can_can_tdt1r_time TIME TIME
@{*/
/**@}*/

/** CAN_CAN_TDT1R_TGT TGT **/
#define CAN_CAN_TDT1R_TGT		(1 << 8)

#define CAN_CAN_TDT1R_DLC_SHIFT		0
#define CAN_CAN_TDT1R_DLC_MASK		0x0f
/** @defgroup can_can_tdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_tdl1r CANTDL1R CAN_TDL1R
@{*/


#define CAN_CAN_TDL1R_DATA3_SHIFT		24
#define CAN_CAN_TDL1R_DATA3_MASK		0xff
/** @defgroup can_can_tdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN_CAN_TDL1R_DATA2_SHIFT		16
#define CAN_CAN_TDL1R_DATA2_MASK		0xff
/** @defgroup can_can_tdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN_CAN_TDL1R_DATA1_SHIFT		8
#define CAN_CAN_TDL1R_DATA1_MASK		0xff
/** @defgroup can_can_tdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN_CAN_TDL1R_DATA0_SHIFT		0
#define CAN_CAN_TDL1R_DATA0_MASK		0xff
/** @defgroup can_can_tdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_tdh1r CANTDH1R CAN_TDH1R
@{*/


#define CAN_CAN_TDH1R_DATA7_SHIFT		24
#define CAN_CAN_TDH1R_DATA7_MASK		0xff
/** @defgroup can_can_tdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN_CAN_TDH1R_DATA6_SHIFT		16
#define CAN_CAN_TDH1R_DATA6_MASK		0xff
/** @defgroup can_can_tdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN_CAN_TDH1R_DATA5_SHIFT		8
#define CAN_CAN_TDH1R_DATA5_MASK		0xff
/** @defgroup can_can_tdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN_CAN_TDH1R_DATA4_SHIFT		0
#define CAN_CAN_TDH1R_DATA4_MASK		0xff
/** @defgroup can_can_tdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_ti2r CANTI2R CAN_TI2R
@{*/


#define CAN_CAN_TI2R_STID_SHIFT		21
#define CAN_CAN_TI2R_STID_MASK		0x7ff
/** @defgroup can_can_ti2r_stid STID STID
@{*/
/**@}*/


#define CAN_CAN_TI2R_EXID_SHIFT		3
#define CAN_CAN_TI2R_EXID_MASK		0x3ffff
/** @defgroup can_can_ti2r_exid EXID EXID
@{*/
/**@}*/

/** CAN_CAN_TI2R_IDE IDE **/
#define CAN_CAN_TI2R_IDE		(1 << 2)
/** CAN_CAN_TI2R_RTR RTR **/
#define CAN_CAN_TI2R_RTR		(1 << 1)
/** CAN_CAN_TI2R_TXRQ TXRQ **/
#define CAN_CAN_TI2R_TXRQ		(1 << 0)

/**@}*/

/** @defgroup can_can_tdt2r CANTDT2R CAN_TDT2R
@{*/


#define CAN_CAN_TDT2R_TIME_SHIFT		16
#define CAN_CAN_TDT2R_TIME_MASK		0xffff
/** @defgroup can_can_tdt2r_time TIME TIME
@{*/
/**@}*/

/** CAN_CAN_TDT2R_TGT TGT **/
#define CAN_CAN_TDT2R_TGT		(1 << 8)

#define CAN_CAN_TDT2R_DLC_SHIFT		0
#define CAN_CAN_TDT2R_DLC_MASK		0x0f
/** @defgroup can_can_tdt2r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_tdl2r CANTDL2R CAN_TDL2R
@{*/


#define CAN_CAN_TDL2R_DATA3_SHIFT		24
#define CAN_CAN_TDL2R_DATA3_MASK		0xff
/** @defgroup can_can_tdl2r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN_CAN_TDL2R_DATA2_SHIFT		16
#define CAN_CAN_TDL2R_DATA2_MASK		0xff
/** @defgroup can_can_tdl2r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN_CAN_TDL2R_DATA1_SHIFT		8
#define CAN_CAN_TDL2R_DATA1_MASK		0xff
/** @defgroup can_can_tdl2r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN_CAN_TDL2R_DATA0_SHIFT		0
#define CAN_CAN_TDL2R_DATA0_MASK		0xff
/** @defgroup can_can_tdl2r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_tdh2r CANTDH2R CAN_TDH2R
@{*/


#define CAN_CAN_TDH2R_DATA7_SHIFT		24
#define CAN_CAN_TDH2R_DATA7_MASK		0xff
/** @defgroup can_can_tdh2r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN_CAN_TDH2R_DATA6_SHIFT		16
#define CAN_CAN_TDH2R_DATA6_MASK		0xff
/** @defgroup can_can_tdh2r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN_CAN_TDH2R_DATA5_SHIFT		8
#define CAN_CAN_TDH2R_DATA5_MASK		0xff
/** @defgroup can_can_tdh2r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN_CAN_TDH2R_DATA4_SHIFT		0
#define CAN_CAN_TDH2R_DATA4_MASK		0xff
/** @defgroup can_can_tdh2r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_ri0r CANRI0R CAN_RI0R
@{*/


#define CAN_CAN_RI0R_STID_SHIFT		21
#define CAN_CAN_RI0R_STID_MASK		0x7ff
/** @defgroup can_can_ri0r_stid STID STID
@{*/
/**@}*/


#define CAN_CAN_RI0R_EXID_SHIFT		3
#define CAN_CAN_RI0R_EXID_MASK		0x3ffff
/** @defgroup can_can_ri0r_exid EXID EXID
@{*/
/**@}*/

/** CAN_CAN_RI0R_IDE IDE **/
#define CAN_CAN_RI0R_IDE		(1 << 2)
/** CAN_CAN_RI0R_RTR RTR **/
#define CAN_CAN_RI0R_RTR		(1 << 1)

/**@}*/

