grevaillot/svd_tools/headers/STM32F091x/can.h
/** @defgroup can_can_rdt0r CANRDT0R CAN_RDT0R
@{*/


#define CAN_CAN_RDT0R_TIME_SHIFT		16
#define CAN_CAN_RDT0R_TIME_MASK		0xffff
/** @defgroup can_can_rdt0r_time TIME TIME
@{*/
/**@}*/


#define CAN_CAN_RDT0R_FMI_SHIFT		8
#define CAN_CAN_RDT0R_FMI_MASK		0xff
/** @defgroup can_can_rdt0r_fmi FMI FMI
@{*/
/**@}*/


#define CAN_CAN_RDT0R_DLC_SHIFT		0
#define CAN_CAN_RDT0R_DLC_MASK		0x0f
/** @defgroup can_can_rdt0r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_rdl0r CANRDL0R CAN_RDL0R
@{*/


#define CAN_CAN_RDL0R_DATA3_SHIFT		24
#define CAN_CAN_RDL0R_DATA3_MASK		0xff
/** @defgroup can_can_rdl0r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN_CAN_RDL0R_DATA2_SHIFT		16
#define CAN_CAN_RDL0R_DATA2_MASK		0xff
/** @defgroup can_can_rdl0r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN_CAN_RDL0R_DATA1_SHIFT		8
#define CAN_CAN_RDL0R_DATA1_MASK		0xff
/** @defgroup can_can_rdl0r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN_CAN_RDL0R_DATA0_SHIFT		0
#define CAN_CAN_RDL0R_DATA0_MASK		0xff
/** @defgroup can_can_rdl0r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_rdh0r CANRDH0R CAN_RDH0R
@{*/


#define CAN_CAN_RDH0R_DATA7_SHIFT		24
#define CAN_CAN_RDH0R_DATA7_MASK		0xff
/** @defgroup can_can_rdh0r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN_CAN_RDH0R_DATA6_SHIFT		16
#define CAN_CAN_RDH0R_DATA6_MASK		0xff
/** @defgroup can_can_rdh0r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN_CAN_RDH0R_DATA5_SHIFT		8
#define CAN_CAN_RDH0R_DATA5_MASK		0xff
/** @defgroup can_can_rdh0r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN_CAN_RDH0R_DATA4_SHIFT		0
#define CAN_CAN_RDH0R_DATA4_MASK		0xff
/** @defgroup can_can_rdh0r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_ri1r CANRI1R CAN_RI1R
@{*/


#define CAN_CAN_RI1R_STID_SHIFT		21
#define CAN_CAN_RI1R_STID_MASK		0x7ff
/** @defgroup can_can_ri1r_stid STID STID
@{*/
/**@}*/


#define CAN_CAN_RI1R_EXID_SHIFT		3
#define CAN_CAN_RI1R_EXID_MASK		0x3ffff
/** @defgroup can_can_ri1r_exid EXID EXID
@{*/
/**@}*/

/** CAN_CAN_RI1R_IDE IDE **/
#define CAN_CAN_RI1R_IDE		(1 << 2)
/** CAN_CAN_RI1R_RTR RTR **/
#define CAN_CAN_RI1R_RTR		(1 << 1)

/**@}*/

/** @defgroup can_can_rdt1r CANRDT1R CAN_RDT1R
@{*/


#define CAN_CAN_RDT1R_TIME_SHIFT		16
#define CAN_CAN_RDT1R_TIME_MASK		0xffff
/** @defgroup can_can_rdt1r_time TIME TIME
@{*/
/**@}*/


#define CAN_CAN_RDT1R_FMI_SHIFT		8
#define CAN_CAN_RDT1R_FMI_MASK		0xff
/** @defgroup can_can_rdt1r_fmi FMI FMI
@{*/
/**@}*/


#define CAN_CAN_RDT1R_DLC_SHIFT		0
#define CAN_CAN_RDT1R_DLC_MASK		0x0f
/** @defgroup can_can_rdt1r_dlc DLC DLC
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_rdl1r CANRDL1R CAN_RDL1R
@{*/


#define CAN_CAN_RDL1R_DATA3_SHIFT		24
#define CAN_CAN_RDL1R_DATA3_MASK		0xff
/** @defgroup can_can_rdl1r_data3 DATA3 DATA3
@{*/
/**@}*/


#define CAN_CAN_RDL1R_DATA2_SHIFT		16
#define CAN_CAN_RDL1R_DATA2_MASK		0xff
/** @defgroup can_can_rdl1r_data2 DATA2 DATA2
@{*/
/**@}*/


#define CAN_CAN_RDL1R_DATA1_SHIFT		8
#define CAN_CAN_RDL1R_DATA1_MASK		0xff
/** @defgroup can_can_rdl1r_data1 DATA1 DATA1
@{*/
/**@}*/


#define CAN_CAN_RDL1R_DATA0_SHIFT		0
#define CAN_CAN_RDL1R_DATA0_MASK		0xff
/** @defgroup can_can_rdl1r_data0 DATA0 DATA0
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_rdh1r CANRDH1R CAN_RDH1R
@{*/


#define CAN_CAN_RDH1R_DATA7_SHIFT		24
#define CAN_CAN_RDH1R_DATA7_MASK		0xff
/** @defgroup can_can_rdh1r_data7 DATA7 DATA7
@{*/
/**@}*/


#define CAN_CAN_RDH1R_DATA6_SHIFT		16
#define CAN_CAN_RDH1R_DATA6_MASK		0xff
/** @defgroup can_can_rdh1r_data6 DATA6 DATA6
@{*/
/**@}*/


#define CAN_CAN_RDH1R_DATA5_SHIFT		8
#define CAN_CAN_RDH1R_DATA5_MASK		0xff
/** @defgroup can_can_rdh1r_data5 DATA5 DATA5
@{*/
/**@}*/


#define CAN_CAN_RDH1R_DATA4_SHIFT		0
#define CAN_CAN_RDH1R_DATA4_MASK		0xff
/** @defgroup can_can_rdh1r_data4 DATA4 DATA4
@{*/
/**@}*/


/**@}*/

/** @defgroup can_can_fmr CANFMR CAN_FMR
@{*/


#define CAN_CAN_FMR_CAN2SB_SHIFT		8
#define CAN_CAN_FMR_CAN2SB_MASK		0x3f
/** @defgroup can_can_fmr_can2sb CAN2SB CAN2SB
@{*/
/**@}*/

/** CAN_CAN_FMR_FINIT FINIT **/
#define CAN_CAN_FMR_FINIT		(1 << 0)

/**@}*/

/** @defgroup can_can_fm1r CANFM1R CAN_FM1R
@{*/

/** CAN_CAN_FM1R_FBM27 Filter mode **/
#define CAN_CAN_FM1R_FBM27		(1 << 27)
/** CAN_CAN_FM1R_FBM26 Filter mode **/
#define CAN_CAN_FM1R_FBM26		(1 << 26)
/** CAN_CAN_FM1R_FBM25 Filter mode **/
#define CAN_CAN_FM1R_FBM25		(1 << 25)
/** CAN_CAN_FM1R_FBM24 Filter mode **/
#define CAN_CAN_FM1R_FBM24		(1 << 24)
/** CAN_CAN_FM1R_FBM23 Filter mode **/
#define CAN_CAN_FM1R_FBM23		(1 << 23)
/** CAN_CAN_FM1R_FBM22 Filter mode **/
#define CAN_CAN_FM1R_FBM22		(1 << 22)
/** CAN_CAN_FM1R_FBM21 Filter mode **/
#define CAN_CAN_FM1R_FBM21		(1 << 21)
/** CAN_CAN_FM1R_FBM20 Filter mode **/
#define CAN_CAN_FM1R_FBM20		(1 << 20)
/** CAN_CAN_FM1R_FBM19 Filter mode **/
#define CAN_CAN_FM1R_FBM19		(1 << 19)
/** CAN_CAN_FM1R_FBM18 Filter mode **/
#define CAN_CAN_FM1R_FBM18		(1 << 18)
/** CAN_CAN_FM1R_FBM17 Filter mode **/
#define CAN_CAN_FM1R_FBM17		(1 << 17)
/** CAN_CAN_FM1R_FBM16 Filter mode **/
#define CAN_CAN_FM1R_FBM16		(1 << 16)
/** CAN_CAN_FM1R_FBM15 Filter mode **/
#define CAN_CAN_FM1R_FBM15		(1 << 15)
/** CAN_CAN_FM1R_FBM14 Filter mode **/
#define CAN_CAN_FM1R_FBM14		(1 << 14)
/** CAN_CAN_FM1R_FBM13 Filter mode **/
#define CAN_CAN_FM1R_FBM13		(1 << 13)
/** CAN_CAN_FM1R_FBM12 Filter mode **/
#define CAN_CAN_FM1R_FBM12		(1 << 12)
/** CAN_CAN_FM1R_FBM11 Filter mode **/
#define CAN_CAN_FM1R_FBM11		(1 << 11)
/** CAN_CAN_FM1R_FBM10 Filter mode **/
#define CAN_CAN_FM1R_FBM10		(1 << 10)
/** CAN_CAN_FM1R_FBM9 Filter mode **/
#define CAN_CAN_FM1R_FBM9		(1 << 9)
/** CAN_CAN_FM1R_FBM8 Filter mode **/
#define CAN_CAN_FM1R_FBM8		(1 << 8)
/** CAN_CAN_FM1R_FBM7 Filter mode **/
#define CAN_CAN_FM1R_FBM7		(1 << 7)
/** CAN_CAN_FM1R_FBM6 Filter mode **/
#define CAN_CAN_FM1R_FBM6		(1 << 6)
/** CAN_CAN_FM1R_FBM5 Filter mode **/
#define CAN_CAN_FM1R_FBM5		(1 << 5)
/** CAN_CAN_FM1R_FBM4 Filter mode **/
#define CAN_CAN_FM1R_FBM4		(1 << 4)
/** CAN_CAN_FM1R_FBM3 Filter mode **/
#define CAN_CAN_FM1R_FBM3		(1 << 3)
/** CAN_CAN_FM1R_FBM2 Filter mode **/
#define CAN_CAN_FM1R_FBM2		(1 << 2)
/** CAN_CAN_FM1R_FBM1 Filter mode **/
#define CAN_CAN_FM1R_FBM1		(1 << 1)
/** CAN_CAN_FM1R_FBM0 Filter mode **/
#define CAN_CAN_FM1R_FBM0		(1 << 0)

/**@}*/

/** @defgroup can_can_fs1r CANFS1R CAN_FS1R
@{*/

/** CAN_CAN_FS1R_FSC27 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC27		(1 << 27)
/** CAN_CAN_FS1R_FSC26 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC26		(1 << 26)
/** CAN_CAN_FS1R_FSC25 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC25		(1 << 25)
/** CAN_CAN_FS1R_FSC24 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC24		(1 << 24)
/** CAN_CAN_FS1R_FSC23 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC23		(1 << 23)
/** CAN_CAN_FS1R_FSC22 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC22		(1 << 22)
/** CAN_CAN_FS1R_FSC21 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC21		(1 << 21)
/** CAN_CAN_FS1R_FSC20 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC20		(1 << 20)
/** CAN_CAN_FS1R_FSC19 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC19		(1 << 19)
/** CAN_CAN_FS1R_FSC18 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC18		(1 << 18)
/** CAN_CAN_FS1R_FSC17 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC17		(1 << 17)
/** CAN_CAN_FS1R_FSC16 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC16		(1 << 16)
/** CAN_CAN_FS1R_FSC15 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC15		(1 << 15)
/** CAN_CAN_FS1R_FSC14 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC14		(1 << 14)
/** CAN_CAN_FS1R_FSC13 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC13		(1 << 13)
/** CAN_CAN_FS1R_FSC12 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC12		(1 << 12)
/** CAN_CAN_FS1R_FSC11 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC11		(1 << 11)
/** CAN_CAN_FS1R_FSC10 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC10		(1 << 10)
/** CAN_CAN_FS1R_FSC9 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC9		(1 << 9)
/** CAN_CAN_FS1R_FSC8 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC8		(1 << 8)
/** CAN_CAN_FS1R_FSC7 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC7		(1 << 7)
/** CAN_CAN_FS1R_FSC6 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC6		(1 << 6)
/** CAN_CAN_FS1R_FSC5 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC5		(1 << 5)
/** CAN_CAN_FS1R_FSC4 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC4		(1 << 4)
/** CAN_CAN_FS1R_FSC3 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC3		(1 << 3)
/** CAN_CAN_FS1R_FSC2 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC2		(1 << 2)
/** CAN_CAN_FS1R_FSC1 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC1		(1 << 1)
/** CAN_CAN_FS1R_FSC0 Filter scale configuration **/
#define CAN_CAN_FS1R_FSC0		(1 << 0)

/**@}*/

